Autodesk.Revit.DB.JunctionType
An enumerated type listing all the junction types for MEP curve types.

Autodesk.Revit.DB.JunctionType.Tee
The junction type is tee.

Autodesk.Revit.DB.JunctionType.Tap
The junction type is tap.